In [5]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [6]:
df = pd.read_csv("../data/total_production_V2.csv")
df

                               country    group  year  units
0                               Angola    April  1990     50
1     Bolivia (Plurinational State of)    April  1990    123
2                               Brazil    April  1990  27286
3                              Burundi    April  1990    487
4                              Ecuador    April  1990   1504
...                                ...      ...   ...    ...
1645                 Trinidad & Tobago  October  2019     12
1646                            Uganda  October  2019   5509
1647                         Venezuela  October  2019    650
1648                          Viet Nam  October  2019  30487
1649                             Yemen  October  2019     91

[1650 rows x 4 columns]

In [18]:
# 1. Columns of interest
df.head()

                            country  group  year  units
0                            Angola  April  1990     50
1  Bolivia (Plurinational State of)  April  1990    123
2                            Brazil  April  1990  27286
3                           Burundi  April  1990    487
4                           Ecuador  April  1990   1504

In [21]:
# Compute averge units by year
avg_by_year = df.groupby(["year"])["units"].mean()
avg_by_year.head()

year
1990    1695.090909
1991    1841.254545
1992    1791.290909
1993    1668.345455
1994    1696.618182
Name: units, dtype: float64

In [22]:
# Compute average units by year, group
avg_by_year_group = df.groupby(["year", "group"])["units"].mean()
avg_by_year_group.head()

year  group
1990  April      2914.000000
      July        517.000000
      October    1435.735294
1991  April      3037.785714
      July        418.000000
Name: units, dtype: float64

In [2]:
# 2. Exploring individual columns

In [3]:
# 3. Plotting 2d distributions of variables of interest vs target variables

In [ ]:
# 4. Analyzing correlations between independent and dependent variables